CREATE OR REPLACE PROCEDURE loadSampleEmployee()
LANGUAGE SQL
AS $$
	insert into equipment (type, model, brand) values
	('Ноутбук', 'RT-1000', 'Asus'),
	('Принтер', 'HP-WV123', null),
	('Сканер', 'SH-200', 'Samsung'),
	('Ноутбук', 'LVT-14000', 'Lenovo'),
	('МФУ', '75-AR-200', 'Xerox');

	insert into employeescredentials (login, password) values
	('clt_User_1', 'PaSSw0rd'),
	('clt_User_2', 'PaSSw0rd'),
	('clt_User_3', 'PaSSw0rd'),
	('clt_User_4', 'PaSSw0rd'),
	('clt_User_5', 'PaSSw0rd'),
	('clt_User_6', 'PaSSw0rd'),
	('clt_User_7', 'PaSSw0rd'),
	('clt_User_8', 'PaSSw0rd'),
	('clt_User_9', 'PaSSw0rd'),
	('clt_User_10', 'PaSSw0rd'),
	('User_01', 'PaSSw0rd'),
	('User_02', 'PaSSw0rd'),
	('User_03', 'PaSSw0rd'),
	('User_04', 'PaSSw0rd');

	insert into customers (okpo, contactphone, physicaladdress, legaladdress, fullname, abbreviatename) values
	(
		'6683972257',
		'84954927725', 
		'г. Москва, Проcпект Вернадского, д.26, к. 2, г. Москва, ул. Тимирязевская, д. 64, стр. А', 
		'г. Москва, ул. Кропоткинская д. 15, стр. 1',
		'ООО «Телекоммуникации города»',
		'ООО «ТелекоммГор'
	),
	(
		'7933736782',
		'74952277736',
		'г. Москва, ул. Арбатская, д. 8, стр.6',
		'г. Москва, ул. Садовая, д.69, стр. 2',
		'ПАО «Офис Связь»',
		'ПАО «ОфСв»'
	);

	insert into customersemployees (employeescode, customersid, name, lastname, middlename, emp_role) values
	(1, 1, 'Георгий', 'Владимиров', 'Алексеевич', 'Начальник отдела кадров'),
	(2, 1, 'Иван', 'Павлов', null, 'Сотрудник отдела кадров'),
	(3, 1, 'Егор', 'Дмитриев', 'Алексеевич', 'Сотрудник отдела кадров'),
	(4, 1, 'Пётр', 'Иванов', 'Андреевич', 'Начальник отдела договоров и услуг'),
	(5, 1, 'Роман', 'Семёнов', 'Алексеевич', 'Сотрудник отдела договоров и услуг'),
	(6, 1, 'Андрей', 'Смирнов', 'Павлович', 'Начальник поста КПП'),
	(7, 2, 'Олег', 'Петров', 'Геннадьевич', 'Начальник отдела кадров'),
	(8, 2, 'Кирилл', 'Андреев', 'Николаевич', 'Главный бухгалтер'),
	(9, 2, 'Иван', 'Романов', 'Олегович', 'Сотрудник бухгалтерии'),
	(10, 2, 'Дмитрий', 'Кириллов', 'Дмитриевич', 'Сотрудник бухгалтерии');

	insert into companyemployees (employeescode, name, lastname, middlename, emp_role) values
	(11, 'Иван', 'Иванов', 'Иванович', 'Главный по распределению задач'),
	(12, 'Пётр', 'Петров', 'Петрович', 'Заместитель главного распределителя'),
	(13, 'Алексей', 'Алексеев', 'Алексеевич', 'Технический эксперт'),
	(14, 'Андрей', 'Андреев', 'Андреевич', 'Помощник технического эксперта');


	insert into agreements (agreementnumber, customerid, created_at, expiration, status) values
	('ДОУ-000000001', 1, '2022-10-10', null, 'Действует'),
	('ДОУ-000000002', 1, '2023-01-10', '2025-01-09', 'Действует'),
	('ДОУ-000000003', 2, '2022-11-07', null, 'Действует');

	insert into applications (number, agreementid, applicantcode, created_at) values
	('3-00000001-22', 1, 1, '2022-11-20 17:14:23'),
	('3-00000001-23', 2, 5, '2023-06-11 08:01:59'),
	('3-00000002-23', 3, 7, '2023-06-11 11:54:02'),
	('3-00000003-23', 1, 3, '2023-08-27 15:06:54');

	insert into tasks (applicationid, workercode, equipmentcode, description, deadline) values
	(1, 11, 1, 'Произвести полную диагностику файловых носителей', '2022-11-30'),
	(2, 11, 2, 'Проверить элементы для подачи бумаги', '2023-06-15'),
	(2, 12, 3, 'Проверить шлейфы работы оборудования дисплея', '2023-06-17'),
	(3, 12, 4, 'Произвести полную диагностику ППК', '2023-06-21'),
	(4, 13, 5, 'Разборка и диагностика оборудования', '2023-09-10');

	insert into subtasks (taskid, workercode, description, deadline) values
	(1, 11, 'Произвести проверку SSD через BIOS и прочую ОС Lite', '2022-11-28'),
	(4, 13, 'Проверка аппаратной части', '2023-06-15'),
	(4, 14, 'Разборка и диагностика ППК на отсутствие коррозий и повреждения магистралей печатной платы', '2023-06-12'),
	(4, 14, 'Проверка основного оборудования на неисправность путём диагностики', '2023-06-15'),
	(4, 13, 'Проверка программной части', '2023-06-21'),
	(5, 14, 'Разобрать МФУ в копировальной части и продиагностировать', '2023-08-31'),
	(5, 14, 'Подборка и устранение неисправный элементов', '2023-09-10');

	insert into components (equipmentcode, type, name) values 
	(1, 'ЦП', 'Intel Core I6'),
	(1, 'ОЗУ', '8Gb'),
	(1, 'SSD', '100Gb'),
	(1, 'HDD', '256Gb'),
	(4, 'ЦП', 'Intel Core I7'),
	(4, 'ОЗУ', '16Gb'),
	(4, 'SSD', '256Gb');

	insert into cars (brand, model, color, number) values
	('Skoda', 'Octavia', 'Чёрный', 'О653НА 97'),
	('Ford', 'Focus 3', 'Чёрный', 'Н326ЕТ 75'),
	('Skoda', 'Octavia', 'Белый', 'А673ЕК 99'),
	('Audi', 'A4', 'Серый', 'О926НО 77');

	insert into intermediaries (fullname, abbreviatename, address, contactphone) values
	('ООО ФирмПром', 'ООО ФП', 'г. Москва, ул. Южная, д. 10 стр. 8', '+7(495)652-66-13'),
	('НПАО Развезём', 'НПАО РазВсё', 'г. Москва, ул. КУтузовская, д. 8, к. 1', '+7(499)126-77-26');

	insert into intermediariesdrivers (intermediarieid, lastname, firstname, middlename, contactphone, carid) values
	(1, 'Иванов', 'Олег', 'Петрович', '+7(924)453-67-22', 1),
	(1, 'Семёнов', 'Алексей', 'Геннадьевич', '+7(956)784-14-68', 2),
	(2, 'Владимиров', 'Павел', 'Дмитриевич', '+7(999)773-24-99', 3),
	(2, 'Романов', 'Роман', 'Александрович', '+7(910)327-88-21', 4);

	insert into intermediariesagreements (number, created_at, intermediarieid, companyemployeeid, status) values
	('ДОП/23-0000000001', '2023-01-20 13:20:40', 1, 1, 'Закрыт'),
	('ДОП/23-0000000002', '2023-10-18 10:10:20', 2, 3, 'Открыт'),
	('ДОП/24-0000000001', '2023-01-22 17:30:26', 1, 3, 'Открыт');
$$;

CALL loadSampleEmployee();